<?php
////////////////////////////////////
//クラスブロック

//--------------------------------------------------------------------------------------
///	ユーティリティ関数群(スタティック呼出をする)
//--------------------------------------------------------------------------------------
class convert_isbn {
	//--------------------------------------------------------------------------------------
	/*!
	@brief	10桁のisbnを10桁に変換する
	@param[in]	$isbn_13 13桁のisbn
	@return	なし
	*/
	//--------------------------------------------------------------------------------------
	public static function to_10($isbn_13){
		if (!preg_match('/^[0-9]{12}[0-9X]{1}$/',$isbn_13)) {
			return '';
		}
		$isbn = str_split(substr($isbn_13,3,-1));
		$sum = 0;
		for($i = 0;$i < 9; ++$i) {
			$sum += $isbn[$i] * (10 - $i);
		}
		$digid = 11 - $sum % 11;
		switch($digid) {
			case 11:
				$digid = 0;
				break;
			case 10:
				$digid = 'X';
				break;
			default:
				break;
		}
		return implode($isbn) . $digid;
	}
}

